<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faculty;
use App\Models\FacultyGrade;
use App\Models\University;

class FacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void

    {
        // Faculties data
        $faculties = [


            [
                'name' => 'كلية الطب - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'location' => 'https://maps.app.goo.gl/jVV4u3DjUwKaeM8g6',
                'website' => 'https://www.alexu.edu.eg/index.php/ar/',
                'logo' => 'logos/alex_medicine.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 388.0],
                ],
            ],

            //أدبي

            [
                [
                    'name' => 'كلية الاقتصاد والعلوم السياسية - جامعة القاهرة',
                    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                    'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                    'address' => 'جامعة القاهرة، الجيزة، مصر',
                    'location' => 'https://maps.app.goo.gl/xDGuYWTmHuPbCpRM9',
                    'website' => 'https://www.feps.edu.eg/',
                    'logo' => 'logos/cairo_economics_politics.png',
                    'grades' => [
                        ['study_track' => 'أدبي', 'minimum_grade' => 364.5],
                    ],
                ]
            ],

            [
                'name' => 'كلية الدراسات الاقتصادية والعلوم السياسية - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع سوتر، الشاطبي، الإسكندرية، مصر',
                'location' => 'https://maps.app.goo.gl/KLeUHeZQVL9tf6cWA',
                'website' => 'https://www.alexu.edu.eg/',
                'logo' => 'logos/alex_economics_politics.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 358.5],
                ],
            ],
            [
                'name' => 'كلية الألسن - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، العباسية، القاهرة',
                'location' => 'https://maps.app.goo.gl/N5QDsPpmAGwVx1F66',
                'website' => 'https://alsun.asu.edu.eg/',
                'logo' => 'logos/ainshams_alsson.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 358.5],
                    ['study_track' => 'علمى علوم', 'minimum_grade' => 348.0],
                    ['study_track' => 'علمى رياضة', 'minimum_grade' => 334.0],
                ],
            ],
            [
                'name' => 'كلية الإعلام - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة',
                'location' => 'https://maps.app.goo.gl/jb8rQUfEcyhd1oL19',
                'website' => 'https://masscomm.cu.edu.eg/',
                'logo' => 'logos/cairo_media.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 354.5],
                ],
            ],
            
    [
        'name'=> 'كلية الألسن - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_alsun',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_alsun.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 351.0],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 331.5]
        ]
        ],

            [
                'name' => 'كلية الإعلام - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'العباسية، القاهرة',
                'location' => 'https://maps.app.goo.gl/EzcrLGygSY8ZBoix7',
                'website' => 'https://www.asu.edu.eg/',
                'logo' => 'logos/ainshams_media.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 349.0],
                ],
            ],
            [
                'name' => 'كلية ألسن - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، محافظة المنيا، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ123',
                'website' => 'https://www.menofia.edu.eg/',
                'logo' => 'logos/alsun_menia.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 348.5],
                    ['study_track' => 'علمى علوم', 'minimum_grade' => 339.5],
                    ['study_track' => 'علمى رياضة', 'minimum_grade' => 316.5],
                ],
            ],
            [
                'name' => 'كلية الاعاقة والتأهيل - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، محافظة الشرقية، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ456',
                'website' => 'https://www.zu.edu.eg/',
                'logo' => 'logos/disability_zu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 342.0],
                ],
            ],
            [
                'name' => 'كلية آثار - جامعة الزقازيق بصان الحجر',
                'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، محافظة الشرقية، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ789',
                'website' => 'https://www.zu.edu.eg/',
                'logo' => 'logos/archaeology_zu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 335.5],
                ],
            ],
            [
                'name' => 'كلية آثار - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، محافظة الجيزة، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ101',
                'website' => 'https://www.cu.edu.eg/',
                'logo' => 'logos/archaeology_cu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 334.0],
                ],
            ],
            [
                'name' => 'كلية آثار - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، محافظة القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ102',
                'website' => 'https://www.asu.edu.eg/',
                'logo' => 'logos/archaeology_asu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 333.0],
                ],
            ],
            [
                'name' => 'كلية تربية - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، محافظة الشرقية، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ103',
                'website' => 'https://www.zu.edu.eg/',
                'logo' => 'logos/education_zu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 320.0],
                    ['study_track' => 'علمي', 'minimum_grade' => 320.0],
                ],
            ],
            [
                'name' => 'كلية تربية - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، محافظة القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/XYZ104',
                'website' => 'https://www.asu.edu.eg/',
                'logo' => 'logos/education_asu.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 319.5],
                ],
            ],
            [
                'name' => 'كلية تربية - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق الحرية، الإسكندرية، مصر',
                'location' => 'https://maps.app.goo.gl/jVV4u3DjUwKaeM8g6',
                'website' => 'https://www.alexu.edu.eg/',
                'logo' => 'logos/alex_education.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 318.5],
                ],
            ],
            [
                'name' => 'كلية تربية - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، محافظة الدقهلية، مصر',
                'location' => 'https://maps.app.goo.gl/xyz123',
                'website' => 'https://www.mans.edu.eg/',
                'logo' => 'logos/mansoura_education.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 318.0],
                ],
            ],
            [
                'name' => 'كلية آداب - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'location' => 'https://maps.app.goo.gl/abc456',
                'website' => 'https://www.cu.edu.eg/',
                'logo' => 'logos/cairo_arts.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 317.5],
                ],
            ],
            [
                'name' => 'كلية فنون جميلة (فنون) - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/def789',
                'website' => 'https://www.helwan.edu.eg/',
                'logo' => 'logos/helwan_fine_arts.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 316.0],
                ],
            ],
            [
                'name' => 'كلية تربية - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، محافظة الغربية، مصر',
                'location' => 'https://maps.app.goo.gl/ghi101',
                'website' => 'https://www.tanta.edu.eg/',
                'logo' => 'logos/tanta_education.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 313.5],
                ],
            ],
            [
                [
                    'name' => 'كلية آداب انتساب موجه - جامعة القاهرة',
                    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                    'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                    'address' => 'جامعة القاهرة، الجيزة، مصر',
                    'location' => 'https://maps.app.goo.gl/jkl345',
                    'website' => 'https://www.cu.edu.eg/',
                    'logo' => 'logos/cairo_arts_extension.png',
                    'grades' => [
                        ['study_track' => 'أدبي', 'minimum_grade' => 309.0],
                    ],
                ],
            ],
            [
                'name' => 'كلية آداب - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/pqr567',
                'website' => 'https://www.asu.edu.eg/',
                'logo' => 'logos/ain_shams_arts.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 308.0],
                ],
            ],
            

            //هندسة

            [
                'name' => 'كلية الهندسة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'location' => 'https://maps.app.goo.gl/UJKxobJ1BzzZYmpq9',
                'website' => 'https://eng.cu.edu.eg/',
                'logo' => 'logos/cairo_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 376.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عباس العقاد، مدينة نصر، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/FgP9dDndQu4zn7yx8',
                'website' => 'https://eng.asu.edu.eg/',
                'logo' => 'logos/ain_shams_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 373.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، الدقهلية، مصر',
                'location' => 'https://maps.app.goo.gl/xjqHEUKoSehF5Qts6',
                'website' => 'https://engfac.mans.edu.eg/',
                'logo' => 'logos/mansoura_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 374.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، جامعة قناة السويس، مصر',
                'location' => 'https://maps.app.goo.gl/4U1LkNnp1mkXJZrA9',
                'website' => 'https://eng.suez.edu.eg/',
                'logo' => 'logos/suez_canal_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 372.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الشرقية، مصر',
                'location' => 'https://maps.app.goo.gl/Asr1FjEAsFFSo7Yt9',
                'website' => 'https://www.zu.edu.eg/',
                'logo' => 'logos/zagazig_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 372.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، الغربية، مصر',
                'location' => 'https://maps.app.goo.gl/rdJUzVa5PWa3P5AE7',
                'website' => 'https://eng.tanta.edu.eg/',
                'logo' => 'logos/tanta_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 370.0],
                ],
            ],

            [
                'name' => 'كلية الهندسة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع أبو قير، الشاطبي، الإسكندرية، مصر',
                'location' => 'https://maps.app.goo.gl/UcNK2nVj5jvJzCQw7',
                'website' => 'https://eng.alexu.edu.eg/',
                'logo' => 'logos/alex_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 369.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/7zEEuC8m6mByrkzA9',
                'website' => 'https://eng.helwan.edu.eg/',
                'logo' => 'logos/helwan_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 367.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'location' => 'https://maps.app.goo.gl/QhzvZ3Zx53cXvXmp8',
                'website' => 'https://www.aun.edu.eg/faculty-engineering/',
                'logo' => 'logos/assiut_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 364.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، محافظة المنيا، مصر',
                'location' => 'https://maps.app.goo.gl/RKZh8UCbK2ANjYMr5',
                'website' => 'https://www.minia.edu.eg/eng/',
                'logo' => 'logos/minia_engineering.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 364.0],
                ],
            ],

            //صيدلة
            [
                'name' => 'كلية الصيدلة - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، جامعة قناة السويس، مصر',
                'location' => 'https://maps.app.goo.gl/jR9iQG9BnyMBZ7r57',
                'website' => 'https://pharm.suez.edu.eg/',
                'logo' => 'logos/suez_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'location' => 'https://maps.app.goo.gl/m1tGUyUohazv9F2q7',
                'website' => 'https://www.minia.edu.eg/Pharmacy/',
                'logo' => 'logos/minia_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'location' => 'https://maps.app.goo.gl/VsEMbmLDNB1dShkN9',
                'website' => 'https://www.aun.edu.eg/pharmacy/',
                'logo' => 'logos/assiut_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 378.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عين حلوان، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/d6T3C3FJvNiBozG19',
                'website' => 'https://pharmacy.helwan.edu.eg/',
                'logo' => 'logos/helwan_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 376.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، الغربية، مصر',
                'location' => 'https://maps.app.goo.gl/Vy1v13L45CqJ9Yxp9',
                'website' => 'https://pharmacy.tanta.edu.eg/',
                'logo' => 'logos/tanta_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع قنال المحمودية، الإسكندرية، مصر',
                'location' => 'https://maps.app.goo.gl/LXRmUrCpHNozshRn6',
                'website' => 'https://www.ph.alexu.edu.eg/',
                'logo' => 'logos/alex_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عبده باشا، العباسية، القاهرة، مصر',
                'location' => 'https://maps.app.goo.gl/KHTRdnS9EQxQjG6T9',
                'website' => 'https://pharm.asu.edu.eg/',
                'logo' => 'logos/ainshams_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 376.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الجيزة، مصر',
                'location' => 'https://maps.app.goo.gl/sBzPa9qDx74RcbgY9',
                'website' => 'https://pharma.cu.edu.eg/',
                'logo' => 'logos/cairo_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الشرقية، مصر',
                'location' => 'https://maps.app.goo.gl/JDuEkW1dbK2YasJX9',
                'website' => 'https://pharm.zu.edu.eg/',
                'logo' => 'logos/zagazig_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، الدقهلية، مصر',
                'location' => 'https://maps.app.goo.gl/V5h6pD8JRB88RA1F9',
                'website' => 'https://phfac.mans.edu.eg/',
                'logo' => 'logos/mansoura_pharmacy.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 378.5],
                ],
            ],

            //طب
            [
        'name'=> 'كلية الطب - جامعة قناة السويس',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_medicine',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 384.5]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة قناة السويس',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_dentistry',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.0]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة قناة السويس',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_vet',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 361.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_medicine',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 383.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_dentistry',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.5]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_vet',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 365.0]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_medicine',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 384.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_dentistry',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.5]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_vet',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 367.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_medicine',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 384.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_medicine',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 387.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_dentistry',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
        'location'=> 'https://maps.app.goo.gl/jVV4u3DjUwKaeM8g6',
        'website'=> 'https://www.alexu.edu.eg/index.php/ar/',
        'logo'=> 'logos/alex_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 388.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_dentistry',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.0]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_vet',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 364.0]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_medicine',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 385.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_dentistry',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.0]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_vet',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 365.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_medicine',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 387.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_dentistry',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.0]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_vet',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 363.0]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_medicine',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 389.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_dentistry',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 381.5]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_vet',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 368.5]
        ]
    ],
    [
        'name'=> 'كلية الطب - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_medicine',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_medicine.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 390.0]
        ]
    ],
    [
        'name'=> 'كلية طب الأسنان - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_dentistry',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_dentistry.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 385.0]
        ]
    ],
    [
        'name'=> 'كلية الطب البيطري - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_vet',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_vet.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 371.5]
        ]
        ],

    //تمريض
    
    [
        'name'=> 'كلية العلاج الطبيعي - جامعة قناة السويس',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_physicaltherapy',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_physicaltherapy.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 378.5]
        ]
    ],
    [
        'name'=> 'كلية العلاج الطبيعي - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_physicaltherapy',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_physicaltherapy.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 378.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_nursing',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 353.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_technursing',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 318.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_nursing',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 345.5]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_technursing',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 317.0]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_nursing',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 348.5]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_technursing',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 321.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_nursing',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 349.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_technursing',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 313.0]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_nursing',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 357.5]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_technursing',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 328.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_nursing',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 349.5]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_technursing',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 322.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_nursing',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 350.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_technursing',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 314.0]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_nursing',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 351.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض أورام - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_oncology_technursing',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_oncology_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 318.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_technursing',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 317.5]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_nursing',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 355.0]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_technursing',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 326.0]
        ]
    ],
    [
        'name'=> 'كلية التمريض - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_nursing',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_nursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 361.5]
        ]
    ],
    [
        'name'=> 'كلية فني تمريض - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_technursing',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_technursing.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 329.0]
        ]
    ]


//حاسبات ومعلومات

    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_computers',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 367.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 352.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_computers',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 371.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 343.0]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_computers',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 372.0],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 342.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والذكاء الاصطناعي - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_computers_ai',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_computers_ai.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 365.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 351.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_computers',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 368.0],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 353.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات وعلوم البيانات - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_computers_data',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_computers_data.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 366.0],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 357.0]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_computers',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 367.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 357.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والذكاء الاصطناعي - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_computers_ai',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_computers_ai.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 368.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 358.5]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_computers',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 369.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 355.1]
        ]
    ],
    [
        'name'=> 'كلية الحاسبات والمعلومات - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_computers',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_computers.png',
        'grades'=> [
            ['study_track'=> 'علمي علوم', 'minimum_grade'=> 370.5],
            ['study_track'=> 'علمي رياضة', 'minimum_grade'=> 357.5]
        ]
    ]


//فنون جميلة

    [
        'name'=> 'كلية الفنون الجميلة (عمارة) - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_finearts_arch',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_finearts_arch.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 321.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (فنون) - جامعة المنيا',
        'university'=> 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'طريق المنيا الجديدة، المنيا، مصر',
        'location'=> 'https://maps.app.goo.gl/minya_finearts_arts',
        'website'=> 'https://www.minia.edu.eg/',
        'logo'=> 'logos/minya_finearts_arts.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 290.5]
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 290.5]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (عمارة) - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_finearts_arch',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_finearts_arch.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 319.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (فنون) - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_finearts_arts',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_finearts_arts.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 288.0]
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 288.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (عمارة) - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_finearts_arch',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_finearts_arch.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 337.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (فنون) - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_finearts_arts',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_finearts_arts.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 298.5]
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 298.5]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (عمارة) - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_finearts_arch',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_finearts_arch.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 332.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (فنون) - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_finearts_arts',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_finearts_arts.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 298.0]
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 298.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (عمارة) - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_finearts_arch',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_finearts_arch.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 330.0]
        ]
    ],
    [
        'name'=> 'كلية الفنون الجميلة (فنون) - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_finearts_arts',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_finearts_arts.png',
        'grades'=> [
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 296.0]
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 296.0]
        ]
    ]


//تجارة
            [
                'name' => 'كلية تجارة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'location' => 'https://maps.app.goo.gl/stu678',
                'website' => 'https://www.cu.edu.eg/',
                'logo' => 'logos/cairo_commerce.png',
                'grades' => [
                ],
            ],

            
    [
        'name'=> 'كلية التجارة - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_commerce',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 308.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 308.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة قناة السويس بالإسماعيلية',
        'university'=> 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
        'location'=> 'https://maps.app.goo.gl/suez_commerce_aff',
        'website'=> 'https://suez.edu.eg/',
        'logo'=> 'logos/suez_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 299.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 299.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_commerce',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 307.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 307.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة أسيوط',
        'university'=> 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، أسيوط، مصر',
        'location'=> 'https://maps.app.goo.gl/assuit_commerce_aff',
        'website'=> 'https://www.aun.edu.eg/',
        'logo'=> 'logos/assuit_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 299.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 299.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة وإدارة الأعمال - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_commerce',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 307.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 307.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة وإدارة الأعمال (انتساب موجه) - جامعة حلوان',
        'university'=> 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، حلوان، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/helwan_commerce_aff',
        'website'=> 'https://www.helwan.edu.eg/',
        'logo'=> 'logos/helwan_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 300.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 300.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_commerce',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 306.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 306.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة طنطا',
        'university'=> 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجيش، طنطا، الغربية، مصر',
        'location'=> 'https://maps.app.goo.gl/tanta_commerce_aff',
        'website'=> 'https://www.tanta.edu.eg/',
        'logo'=> 'logos/tanta_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 301.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 301.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_commerce',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 308.5]و
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 308.5]و
            ['study_track' => 'أدبي', 'minimum_grade' => 308.0],
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة الإسكندرية',
        'university'=> 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
        'location'=> 'https://maps.app.goo.gl/alex_commerce_aff',
        'website'=> 'https://www.alexu.edu.eg/',
        'logo'=> 'logos/alex_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 305.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 305.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_commerce',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 304.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 304.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة عين شمس',
        'university'=> 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الخليفة المأمون، القاهرة، مصر',
        'location'=> 'https://maps.app.goo.gl/ainshams_commerce_aff',
        'website'=> 'https://www.asu.edu.eg/',
        'logo'=> 'logos/ainshams_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 300.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 300.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_commerce',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 306.5],
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 306.5],
                                ['study_track' => 'أدبي', 'minimum_grade' => 307.5],

        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة القاهرة',
        'university'=> 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع القصر العيني، الجيزة، مصر',
        'location'=> 'https://maps.app.goo.gl/cairo_commerce_aff',
        'website'=> 'https://cu.edu.eg/',
        'logo'=> 'logos/cairo_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 302.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 302.0]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_commerce',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 317.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 317.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة الزقازيق',
        'university'=> 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجامعة، الزقازيق، الشرقية، مصر',
        'location'=> 'https://maps.app.goo.gl/zagazig_commerce_aff',
        'website'=> 'https://www.zu.edu.eg/',
        'logo'=> 'logos/zagazig_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 307.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 307.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_commerce',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_commerce.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 318.5]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 318.5]
        ]
    ],
    [
        'name'=> 'كلية التجارة (انتساب موجه) - جامعة المنصورة',
        'university'=> 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration'=> 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address'=> 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
        'location'=> 'https://maps.app.goo.gl/mansoura_commerce_aff',
        'website'=> 'https://www.mans.edu.eg/',
        'logo'=> 'logos/mansoura_commerce_aff.png',
        'grades'=> [
            ['study_track'=> 'علمى علوم', 'minimum_grade'=> 311.0]
            ['study_track'=> 'علمى رياضة', 'minimum_grade'=> 311.0]
        ]
    ]


//حقوق

    [
        'name' => 'كلية الحقوق - جامعة المنيا',
        'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنيا، المنيا، مصر',
        'location' => 'https://maps.app.goo.gl/minya_university', // Placeholder link
        'website' => 'https://www.minia.edu.eg/', // General university website
        'logo' => 'logos/minya_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 323.5],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة أسيوط',
        'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة أسيوط، أسيوط، مصر',
        'location' => 'https://maps.app.goo.gl/assiut_university', // Placeholder link
        'website' => 'https://www.aun.edu.eg/', // General university website
        'logo' => 'logos/assiut_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 287.5],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة حلوان',
        'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة حلوان، حلوان، مصر',
        'location' => 'https://maps.app.goo.gl/helwan_university', // Placeholder link
        'website' => 'https://www.helwan.edu.eg/', // General university website
        'logo' => 'logos/helwan_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 273.0],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة طنطا',
        'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة طنطا، طنطا، مصر',
        'location' => 'https://maps.app.goo.gl/tanta_university', // Placeholder link
        'website' => 'https://www.tanta.edu.eg/', // General university website
        'logo' => 'logos/tanta_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 274.0],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة الإسكندرية',
        'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
        'location' => 'https://maps.app.goo.gl/alexandria_university', // Placeholder link
        'website' => 'https://www.alexu.edu.eg/', // General university website
        'logo' => 'logos/alexandria_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 277.5],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة عين شمس',
        'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة عين شمس، القاهرة، مصر',
        'location' => 'https://maps.app.goo.gl/ainshams_university', // Placeholder link
        'website' => 'https://www.asu.edu.eg/', // General university website
        'logo' => 'logos/ainshams_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 275.0],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة القاهرة',
        'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة القاهرة، الجيزة، مصر',
        'location' => 'https://maps.app.goo.gl/cairo_university', // Placeholder link
        'website' => 'https://cu.edu.eg/', // General university website
        'logo' => 'logos/cairo_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 280.5],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة الزقازيق',
        'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الزقازيق، الزقازيق، مصر',
        'location' => 'https://maps.app.goo.gl/zagazig_university', // Placeholder link
        'website' => 'https://www.zu.edu.eg/', // General university website
        'logo' => 'logos/zagazig_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 289.5],
        ],
    ],
    [
        'name' => 'كلية الحقوق - جامعة المنصورة',
        'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنصورة، المنصورة، مصر',
        'location' => 'https://maps.app.goo.gl/mansoura_university', // Placeholder link
        'website' => 'https://www.mans.edu.eg/', // General university website
        'logo' => 'logos/mansoura_law.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'أدبي', 'minimum_grade' => 282.0],
        ],
    ],


//تربية
 
        'name' => 'كلية التربية - جامعة قناة السويس بالإسماعيلية',
        'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة قناة السويس، الإسماعيلية، مصر',
        'location' => 'https://maps.app.goo.gl/suez_canal_university', // Placeholder link
        'website' => 'https://suezuniv.edu.eg/', // General university website
        'logo' => 'logos/suez_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 299.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 250.5],
        ],
    ,

    [
        'name' => 'كلية التربية - جامعة المنيا',
        'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنيا، المنيا، مصر',
        'location' => 'https://maps.app.goo.gl/minya_university', // Placeholder link
        'website' => 'https://www.minia.edu.eg/', // General university website
        'logo' => 'logos/minya_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 291.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 243.0],
        ],
    ],

    [
        'name' => 'كلية التربية - جامعة أسيوط',
        'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة أسيوط، أسيوط، مصر',
        'location' => 'https://maps.app.goo.gl/assiut_university', // Placeholder link
        'website' => 'https://www.aun.edu.eg/', // General university website
        'logo' => 'logos/assiut_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 242.0],
        ],
    ],
    
    [
        'name' => 'كلية التربية - جامعة حلوان',
        'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة حلوان، حلوان، مصر',
        'location' => 'https://maps.app.goo.gl/helwan_university', // Placeholder link
        'website' => 'https://www.helwan.edu.eg/', // General university website
        'logo' => 'logos/helwan_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 268.0],
        ],
    ],
    
    [
        'name' => 'كلية التربية - جامعة طنطا',
        'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة طنطا، طنطا، مصر',
        'location' => 'https://maps.app.goo.gl/tanta_university', // Placeholder link
        'website' => 'https://www.tanta.edu.eg/', // General university website
        'logo' => 'logos/tanta_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 301.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 262.0],
        ],
    ],
    
    [
        'name' => 'كلية التربية - جامعة الإسكندرية',
        'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
        'location' => 'https://maps.app.goo.gl/alexandria_university', // Placeholder link
        'website' => 'https://www.alexu.edu.eg/', // General university website
        'logo' => 'logos/alexandria_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 297.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 273.0],
        ],
    ],

    [
        'name' => 'كلية التربية - جامعة عين شمس',
        'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة عين شمس، القاهرة، مصر',
        'location' => 'https://maps.app.goo.gl/ainshams_university', // Placeholder link
        'website' => 'https://www.asu.edu.eg/', // General university website
        'logo' => 'logos/ainshams_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 293.5],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 275.5],
        ],
    ],
   
    [
        'name' => 'كلية التربية - جامعة الزقازيق',
        'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الزقازيق، الزقازيق، مصر',
        'location' => 'https://maps.app.goo.gl/zagazig_university', // Placeholder link
        'website' => 'https://www.zu.edu.eg/', // General university website
        'logo' => 'logos/zagazig_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 315.5],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 266.5],
        ],
    ],
    
    [
        'name' => 'كلية التربية - جامعة المنصورة',
        'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنصورة، المنصورة، مصر',
        'location' => 'https://maps.app.goo.gl/mansoura_university', // Placeholder link
        'website' => 'https://www.mans.edu.eg/', // General university website
        'logo' => 'logos/mansoura_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 310.0],
            ['study_track' => 'علمي رياضة', 'minimum_grade' => 253.0],
        ],
    ],

    //تربية نوعية

    
    [
        'name' => 'كلية التربية النوعية - جامعة المنيا',
        'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنيا، المنيا، مصر',
        'location' => 'https://maps.app.goo.gl/minya_university', // Placeholder link
        'website' => 'https://www.minia.edu.eg/', // General university website
        'logo' => 'logos/minya_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 257.5],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة أسيوط',
        'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة أسيوط، أسيوط، مصر',
        'location' => 'https://maps.app.goo.gl/assiut_university', // Placeholder link
        'website' => 'https://www.aun.edu.eg/', // General university website
        'logo' => 'logos/assiut_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 254.5],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة طنطا',
        'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة طنطا، طنطا، مصر',
        'location' => 'https://maps.app.goo.gl/tanta_university', // Placeholder link
        'website' => 'https://www.tanta.edu.eg/', // General university website
        'logo' => 'logos/tanta_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 257.0],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة الإسكندرية',
        'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
        'location' => 'https://maps.app.goo.gl/alexandria_university', // Placeholder link
        'website' => 'https://www.alexu.edu.eg/', // General university website
        'logo' => 'logos/alexandria_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 259.0],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة عين شمس',
        'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة عين شمس، القاهرة، مصر',
        'location' => 'https://maps.app.goo.gl/ainshams_university', // Placeholder link
        'website' => 'https://www.asu.edu.eg/', // General university website
        'logo' => 'logos/ainshams_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 261.5],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة القاهرة',
        'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة القاهرة، الجيزة، مصر',
        'location' => 'https://maps.app.goo.gl/cairo_university', // Placeholder link
        'website' => 'https://cu.edu.eg/', // General university website
        'logo' => 'logos/cairo_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 263.0],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة الزقازيق',
        'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الزقازيق، الزقازيق، مصر',
        'location' => 'https://maps.app.goo.gl/zagazig_university', // Placeholder link
        'website' => 'https://www.zu.edu.eg/', // General university website
        'logo' => 'logos/zagazig_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 255.5],
        ],
    ],
    [
        'name' => 'كلية التربية النوعية - جامعة المنصورة',
        'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنصورة، المنصورة، مصر',
        'location' => 'https://maps.app.goo.gl/mansoura_university', // Placeholder link
        'website' => 'https://www.mans.edu.eg/', // General university website
        'logo' => 'logos/mansoura_specific_education.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 259.0],
        ],
    ],



    [
        'name' => 'كلية الآداب - جامعة المنيا',
        'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنيا، المنيا، مصر',
        'location' => 'https://maps.app.goo.gl/minya_university', // Placeholder link
        'website' => 'https://www.minia.edu.eg/', // General university website
        'logo' => 'logos/minya_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 265.5],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة أسيوط',
        'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة أسيوط، أسيوط، مصر',
        'location' => 'https://maps.app.goo.gl/assiut_university', // Placeholder link
        'website' => 'https://www.aun.edu.eg/', // General university website
        'logo' => 'logos/assiut_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 265.0],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة حلوان',
        'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة حلوان، حلوان، مصر',
        'location' => 'https://maps.app.goo.gl/helwan_university', // Placeholder link
        'website' => 'https://www.helwan.edu.eg/', // General university website
        'logo' => 'logos/helwan_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 277.5],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة طنطا',
        'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة طنطا، طنطا، مصر',
        'location' => 'https://maps.app.goo.gl/tanta_university', // Placeholder link
        'website' => 'https://www.tanta.edu.eg/', // General university website
        'logo' => 'logos/tanta_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 270.5],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة الإسكندرية',
        'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
        'location' => 'https://maps.app.goo.gl/alexandria_university', // Placeholder link
        'website' => 'https://www.alexu.edu.eg/', // General university website
        'logo' => 'logos/alexandria_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 277.0],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة عين شمس',
        'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة عين شمس، القاهرة، مصر',
        'location' => 'https://maps.app.goo.gl/ainshams_university', // Placeholder link
        'website' => 'https://www.asu.edu.eg/', // General university website
        'logo' => 'logos/ainshams_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 280.5],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة القاهرة',
        'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة القاهرة، الجيزة، مصر',
        'location' => 'https://maps.app.goo.gl/cairo_university', // Placeholder link
        'website' => 'https://cu.edu.eg/', // General university website
        'logo' => 'logos/cairo_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 292.0],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة الزقازيق',
        'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة الزقازيق، الزقازيق، مصر',
        'location' => 'https://maps.app.goo.gl/zagazig_university', // Placeholder link
        'website' => 'https://www.zu.edu.eg/', // General university website
        'logo' => 'logos/zagazig_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 270.5],
        ],
    ],
    [
        'name' => 'كلية الآداب - جامعة المنصورة',
        'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
        'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
        'address' => 'جامعة المنصورة، المنصورة، مصر',
        'location' => 'https://maps.app.goo.gl/mansoura_university', // Placeholder link
        'website' => 'https://www.mans.edu.eg/', // General university website
        'logo' => 'logos/mansoura_arts.png', // Placeholder logo path
        'grades' => [
            ['study_track' => 'علمي علوم', 'minimum_grade' => 275.0],
            ['study_track' => '', 'minimum_grade' => null], // Not typically applicable
            ['study_track' => 'علمي رياضة', 'minimum_grade' => null], // Not typically applicable
        ],
    ],




//زراعة
[
    'name' => 'كلية الزراعة - جامعة قناة السويس (الإسماعيلية)',
    'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع يتوافق مع الحد الأدنى المعلن.',
    'address' => 'الإسماعيلية، مصر',
    'location' => 'https://goo.gl/maps/xyz123', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://agri.suez.edu.eg/', // الموقع الرسمي للكلية
    'logo' => 'logos/suez_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 285.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 265.0],
    ],
],
[
    'name' => 'كلية الزراعة - جامعة المنيا',
    'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) وفقًا للحد الأدنى المعلن.',
    'address' => 'المنيا، مصر',
    'location' => 'https://goo.gl/maps/abc456', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://agr.minia.edu.eg/', // الموقع الرسمي للكلية
    'logo' => 'logos/minia_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 283.5],
    ],
],
[
    'name' => 'كلية الزراعة - جامعة أسيوط',
    'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع يتناسب مع الحد الأدنى المعلن.',
    'address' => 'أسيوط، مصر',
    'location' => 'https://goo.gl/maps/def789', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://aun.edu.eg/agriculture/ar', // الموقع الرسمي للكلية
    'logo' => 'logos/assuit_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 265.0],
    ],
],
[
    'name' => 'كلية الزراعة - جامعة طنطا',
    'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) وفقًا للحد الأدنى المعلن.',
    'address' => 'طنطا، مصر',
    'location' => 'https://goo.gl/maps/ghi012', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://agr.tanta.edu.eg/', // الموقع الرسمي للكلية
    'logo' => 'logos/tanta_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 294.5],
    ],
],
[
    'name' => 'كلية الزراعة - جامعة الإسكندرية',
    'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع يتوافق مع الحد الأدنى المعلن.',
    'address' => 'الإسكندرية، مصر',
    'location' => 'https://goo.gl/maps/jkl345', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://agr.alexu.edu.eg/', // الموقع الرسمي للكلية
    'logo' => 'logos/alex_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 300.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 296.0],
    ],
],
[
    'name' => 'كلية الزراعة - جامعة عين شمس',
    'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) وفقًا للحد الأدنى المعلن.',
    'address' => 'القاهرة، مصر',
    'location' => 'https://goo.gl/maps/mno678', // رابط موقع الكلية على خرائط جوجل
    'website' => 'https://agr.asu.edu.eg/', // الموقع الرسمي للكلية
    'logo' => 'logos/ain_agriculture.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 300.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 286.0],
    ],
],

    //علوم
    [
    'name' => 'كلية العلوم - جامعة قناة السويس (الإسماعيلية)',
    'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'الإسماعيلية، مصر',
    'location' => 'https://goo.gl/maps/xyz123',
    'website' => 'https://suez.edu.eg/ar/كلية-العلوم/',
    'logo' => 'logos/suez_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 337.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 297.0],
    ],
],
[
    'name' => 'كلية العلوم - جامعة المنيا',
    'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'المنيا، مصر',
    'location' => 'https://goo.gl/maps/abc456',
    'website' => 'https://sci.minia.edu.eg/',
    'logo' => 'logos/minia_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 335.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 281.0],
    ],
],
[
    'name' => 'كلية العلوم - جامعة أسيوط',
    'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'أسيوط، مصر',
    'location' => 'https://goo.gl/maps/def789',
    'website' => 'https://www.aun.edu.eg/science/ar',
    'logo' => 'logos/assuit_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 342.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 286.0],
    ],
],
[
    'name' => 'كلية العلوم - جامعة حلوان',
    'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'حلوان، القاهرة، مصر',
    'location' => 'https://goo.gl/maps/ghi012',
    'website' => 'https://www.helwan.edu.eg/',
    'logo' => 'logos/helwan_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 331.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 299.5],
    ],
],
[
    'name' => 'كلية العلوم - جامعة طنطا',
    'university' => 'جامعة طنطا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'طنطا، الغربية، مصر',
    'location' => 'https://goo.gl/maps/jkl345',
    'website' => 'https://sci.tanta.edu.eg/',
    'logo' => 'logos/tanta_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 338.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 302.5],
    ],
],
[
    'name' => 'كلية الدراسات الاقتصادية والعلوم السياسية - جامعة الإسكندرية',
    'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط القبول الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) بمجموع لا يقل عن الحد الأدنى المعلن.',
    'address' => 'الإسكندرية، مصر',
    'location' => 'https://goo.gl/maps/mno678',
    'website' => 'https://alexu.edu.eg/',
    'logo' => 'logos/alex_economics_political_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 346.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 332.5],
    ],
],

[
    'name' => 'كلية العلوم - جامعة عين شمس',
    'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'القبول يشترط الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) حسب الحد الأدنى.',
    'address' => 'عباس العقاد، مدينة نصر، القاهرة، مصر',
    'location' => 'https://goo.gl/maps/HXn8DdN1r5vqQFd47',
    'website' => 'https://science.asu.edu.eg/',
    'logo' => 'logos/asu_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 335.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 311.0],
    ],
],
[
    'name' => 'كلية العلوم - جامعة القاهرة',
    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'القبول متاح لطلاب الثانوية العامة (علمي علوم أو علمي رياضة) حسب الحد الأدنى للقبول.',
    'address' => 'شارع الجامعة، الجيزة، مصر',
    'location' => 'https://goo.gl/maps/mKhE4akqYrwpX3Dq7',
    'website' => 'https://sci.cu.edu.eg/',
    'logo' => 'logos/cairo_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 338.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 316.5],
    ],
],
[
    'name' => 'كلية العلوم - جامعة الزقازيق',
    'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يُشترط مجموع الحد الأدنى المعلن للقبول في الثانوية العامة (علمي علوم أو علمي رياضة).',
    'address' => 'الزقازيق، محافظة الشرقية، مصر',
    'location' => 'https://goo.gl/maps/4dzzy3JP3TK52NoB6',
    'website' => 'https://www.zu.edu.eg/',
    'logo' => 'logos/zagazig_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 344.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 305.5],
    ],
],
[
    'name' => 'كلية العلوم - جامعة المنصورة',
    'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'يشترط الحصول على شهادة الثانوية العامة (علمي علوم أو علمي رياضة) وفق الحد الأدنى.',
    'address' => 'المنصورة، الدقهلية، مصر',
    'location' => 'https://goo.gl/maps/Uksv7CZVNqjKkDKK8',
    'website' => 'https://sciencefac.mans.edu.eg/',
    'logo' => 'logos/mansoura_science.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 342.0],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 300.5],
    ],
],
[
    'name' => 'كلية الاقتصاد والعلوم السياسية - جامعة القاهرة',
    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'القبول يتطلب مجموع مرتفع في الثانوية العامة (علمي علوم أو علمي رياضة).',
    'address' => 'شارع الجامعة، الجيزة، مصر',
    'location' => 'https://goo.gl/maps/WP3uMZ2W2Zb5E7D9A',
    'website' => 'https://www.feps.edu.eg/',
    'logo' => 'logos/cairo_economics_political.png',
    'grades' => [
        ['study_track' => 'علمي علوم', 'minimum_grade' => 354.5],
        ['study_track' => 'علمي رياضة', 'minimum_grade' => 337.5],
    ],
],

//سياحة وفنادق


[
    'name' => 'كلية السياحة والفنادق - جامعة قناة السويس',
    'university' => 'جامعة قناة السويس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'الحصول على شهادة الثانوية العامة بأي شعبة وتحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة قناة السويس، الإسماعيلية، مصر',
    'location' => 'https://goo.gl/maps/73kJQvB3XZkXoxLz8',
    'website' => 'https://suh.suez.edu.eg/',
    'logo' => 'logos/suez_tourism.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
    ],
],
[
    'name' => 'كلية السياحة والفنادق - جامعة المنيا',
    'university' => 'جامعة المنيا',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة وتحقيق الحد الأدنى.',
    'address' => 'جامعة المنيا، طريق مصر أسيوط الزراعي، المنيا، مصر',
    'location' => 'https://goo.gl/maps/zCtFa98RUnEQ7Kfq8',
    'website' => 'https://www.minia.edu.eg/tourism/',
    'logo' => 'logos/minia_tourism.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
    ],
],
[
    'name' => 'كلية السياحة والفنادق - جامعة الإسكندرية',
    'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأحد الشعب وبلوغ الحد الأدنى.',
    'address' => 'الطابية، قسم باب شرق، الإسكندرية، مصر',
    'location' => 'https://goo.gl/maps/mxqBDKc9dpUdY8Aw5',
    'website' => 'https://alexu.edu.eg/',
    'logo' => 'logos/alex_tourism.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
    ],
],
[
    'name' => 'كلية السياحة والفنادق - جامعة المنصورة',
    'university' => 'جامعة المنصورة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة وتحقيق الحد الأدنى المطلوب.',
    'address' => 'جامعة المنصورة، الدقهلية، مصر',
    'location' => 'https://goo.gl/maps/KkaWEXdZkdcwAixn6',
    'website' => 'https://www.tourismfac.mans.edu.eg/',
    'logo' => 'logos/mansoura_tourism.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
    ],
],

[
    'name' => 'كلية الخدمة الاجتماعية - جامعة أسيوط',
    'university' => 'جامعة أسيوط',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة أسيوط، أسيوط، مصر',
    'location' => 'https://goo.gl/maps/Pd14vwo2sctZED2s9',
    'website' => 'https://www.aun.edu.eg/',
    'logo' => 'logos/assuit_social.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 247.5],
    ],
],
[
    'name' => 'كلية الخدمة الاجتماعية - جامعة حلوان',
    'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة حلوان، حلوان، مصر',
    'location' => 'https://goo.gl/maps/6hMC4h8gnEw3e5F6A',
    'website' => 'https://www.helwan.edu.eg/',
    'logo' => 'logos/helwan_social.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 253.5],
    ],
],

[
    'name' => 'كلية الإعلام - جامعة عين شمس',
    'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة عين شمس، القاهرة، مصر',
    'location' => 'https://goo.gl/maps/G6jqq97pzvF3uoR69',
    'website' => 'https://www.fms.edu.eg/',
    'logo' => 'logos/ain_shams_media.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 333.5],
        ['study_track' => 'علمى رياضة', 'minimum_grade' => 325.5],
    ],
],
[
    'name' => 'كلية الإعلام - جامعة القاهرة',
    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة القاهرة، الجيزة، مصر',
    'location' => 'https://goo.gl/maps/X7A6bxwMTUzp94Wm6',
    'website' => 'https://www.fms.edu.eg/',
    'logo' => 'logos/cairo_media.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 336.5],
        ['study_track' => 'علمى رياضة', 'minimum_grade' => 327.5],
    ],
],

[
    'name' => 'كلية الآثار - جامعة عين شمس',
    'university' => 'جامعة عين شمس',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة عين شمس، القاهرة، مصر',
    'location' => 'https://goo.gl/maps/7QecFThY5oM2',
    'website' => 'https://www.asu.edu.eg/',
    'logo' => 'logos/ain_shams_archaeology.png',
    'grades' => [
        ['study_track' => 'علمى علوم', 'minimum_grade' => 312.5],
    ],
],
[
    'name' => 'كلية الآثار - جامعة القاهرة',
    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة القاهرة، الجيزة، مصر',
    'location' => 'https://goo.gl/maps/sbcGfDKuJsk',
    'website' => 'https://www.faa.edu.eg/',
    'logo' => 'logos/cairo_archaeology.png',
    'grades' => [
        ['study_track' => 'علمى علوم', 'minimum_grade' => 315.5],
    ],
],
[
    'name' => 'كلية الآثار - جامعة الزقازيق (صان الحجر)',
    'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة الزقازيق، صان الحجر، الشرقية، مصر',
    'location' => 'https://goo.gl/maps/jnWZzqk5qgu',
    'website' => 'https://www.sue.edu.eg/',
    'logo' => 'logos/zuqazig_archaeology.png',
    'grades' => [
        ['study_track' => 'علمى علوم', 'minimum_grade' => 327.5],
    ],
],

[
    'name' => 'كلية الاقتصاد المنزلي - جامعة حلوان',
    'university' => 'جامعة حلوان',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة حلوان، حلوان، مصر',
    'location' => 'https://goo.gl/maps/6hMC4h8gnEw3e5F6A',
    'website' => 'https://www.helwan.edu.eg/',
    'logo' => 'logos/helwan_home_economics.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 253.0],
    ],
],

[
    'name' => 'كلية التخطيط العمراني - جامعة القاهرة',
    'university' => 'جامعة القاهرة',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 5,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة القاهرة، الجيزة، مصر',
    'location' => 'https://goo.gl/maps/X7A6bxwMTUzp94Wm6',
    'website' => 'https://www.cu.edu.eg/',
    'logo' => 'logos/cairo_urban_planning.png',
    'grades' => [
        ['study_track' => 'علمى رياضة', 'minimum_grade' => 360.0],
    ],
],

[
    'name' => 'كلية الإعاقة والتأهيل - جامعة الزقازيق',
    'university' => 'جامعة الزقازيق',
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
    'duration' => 4,
    'requirements' => 'شهادة الثانوية العامة بأي شعبة مع تحقيق الحد الأدنى للقبول.',
    'address' => 'جامعة الزقازيق، الزقازيق، مصر',
    'location' => 'https://goo.gl/maps/jnWZzqk5qgu',
    'website' => 'https://www.sue.edu.eg/',
    'logo' => 'logos/zu_disability_rehabilitation.png',
    'grades' => [
        ['study_track' => 'أدبي', 'minimum_grade' => 340.0],
    ],
],



        ];



        







        foreach ($faculties as $facultyData) {
            // Find university
            $university = University::where('name', $facultyData['university'])->first();

            if (!$university) {
                continue; // Skip if university is not found
            }

            // Create faculty
            $faculty = Faculty::create([
                'name' => $facultyData['name'],
                'university_id' => $university->id,
                'description' => 'كلية الطب بجامعة الإسكندرية، تقدم برنامجاً دراسياً مدته ٧ سنوات يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => $facultyData['duration'],
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => $facultyData['address'],
                'website' => $facultyData['website'],
                'logo' => $facultyData['logo'],
            ]);

            // Add grades
            foreach ($facultyData['grades'] as $grade) {
                FacultyGrade::create([
                    'faculty_id' => $faculty->id,
                    'study_track' => $grade['study_track'],
                    'minimum_grade' => $grade['minimum_grade'],
                ]);
            }
    }
}
}
