<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faculty;
use App\Models\FacultyGrade;
use App\Models\University;
use Illuminate\Support\Facades\Log;
use Illuminate\Support\Facades\DB;



class FacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void

    {
        // DB::table('faculties')->truncate();

        // Faculties data
        $faculties = [

            [
                'name' => 'كلية الخدمة الاجتماعية - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/23.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بإعداد وتأهيل الأخصائيين الاجتماعيين المؤهلين للعمل في مختلف مجالات الخدمة الاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات الخدمة الاجتماعية مع الأفراد والجماعات والمجتمعات، بهدف إعداد خريجين مؤهلين للعمل في المؤسسات الاجتماعية والمراكز الصحية والمدارس والمجتمع.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 247.5],
                ],
            ],
            [
                'name' => 'كلية الخدمة الاجتماعية - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/23.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بإعداد وتأهيل الأخصائيين الاجتماعيين المؤهلين للعمل في مختلف مجالات الخدمة الاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات الخدمة الاجتماعية مع الأفراد والجماعات والمجتمعات، بهدف إعداد خريجين مؤهلين للعمل في المؤسسات الاجتماعية والمراكز الصحية والمدارس والمجتمع.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، حلوان، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 253.5],
                ],
            ],

            [
                'name' => 'كلية الاقتصاد المنزلي - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/24.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة العلوم المتعلقة بالأسرة والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات التغذية وعلوم الأطعمة والملابس والنسيج وإدارة مؤسسات الأسرة والطفولة والاقتصاد المنزلي التربوي والصناعات الجلدية، بهدف إعداد خريجين مؤهلين للعمل في مجالات التغذية والملابس والنسيج والخدمات الاجتماعية والتعليم.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، حلوان، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 253.0],
                ],
            ],

            [
                'name' => 'كلية الاقتصاد والعلوم السياسية - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/2.jpeg',
                'description' => 'كلية الدراسات الاقتصادية والعلوم السياسية بجامعة الإسكندرية هي مؤسسة أكاديمية تُعنى بدراسة العلوم الاقتصادية والسياسية. تقدم الكلية برامج دراسية متنوعة في مجالات الاقتصاد والعلوم السياسية والإحصاء، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والاستشارات الاقتصادية والسياسية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://www.feps.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 364.5],
                ],
            ],



            [
                'name' => 'كلية التخطيط العمراني - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/26.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بتأهيل المخططين العمرانيين المؤهلين للعمل في مجال التنمية الحضرية والتخطيط الإقليمي. تقدم الكلية برامج دراسية متنوعة في مجالات التخطيط الحضري والإقليمي والتصميم العمراني والتنمية المستدامة، بهدف إعداد خريجين مؤهلين للعمل في المؤسسات الحكومية والشركات الخاصة ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://www.cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 360.0],
                ],
            ],

            [
                'name' => 'كلية الاعاقة والتأهيل - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/27.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بتأهيل الكوادر المتخصصة في التعامل مع الأشخاص ذوي الإعاقة. تقدم الكلية برامج دراسية متنوعة في مجالات التربية الخاصة وعلم النفس الإكلينيكي والتأهيل المهني، بهدف إعداد خريجين مؤهلين للعمل في مراكز التأهيل والمدارس والمؤسسات الاجتماعية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، محافظة الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 342.0],
                ],
            ],


            //حاسبات -ومعلومات
            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 367.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 352.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والذكاء الاصطناعي - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 365.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 351.5]
                ]
            ],
            [
                'name' => 'كلية الحاسبات وعلوم البيانات - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 366.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 357.0]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 371.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 343.0]
                ]
            ],
            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 372.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 342.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 368.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 353.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 367.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 357.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 370.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 357.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والذكاء الاصطناعي - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 368.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 358.5]
                ]
            ],

            [
                'name' => 'كلية الحاسبات والمعلومات - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/16.jpeg',
                'description' => " مؤسسة أكاديمية رائدة تهدف إلى إعداد كوادر متخصصة في مجالات علوم الحاسب وتكنولوجيا المعلومات. تقدم الكلية برامج دراسية متطورة تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب لسوق العمل المتنامي في هذا القطاع الحيوي.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 369.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 355.1]
                ]
            ],

            //كلية الإعاقة -والتأهيل
            [
                'name' => 'كلية الإعاقة والتأهيل - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/27.jpeg',
                "description" => "كلية الإعاقة والتأهيل بجامعة الزقازيق هي كلية متخصصة تهدف إلى إعداد كوادر مؤهلة للعمل في مجال تأهيل الأشخاص ذوي الإعاقة. تقدم الكلية برامج دراسية تجمع بين الجانبين النظري والتطبيقي، لتأهيل الطلاب للعمل في مختلف المؤسسات التي تتعامل مع ذوي الإعاقة.",
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الزقازيق، مصر',
                'website' => 'https://www.sue.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 340.0],
                ],
            ],

            //كلية -التجارة

            [
                'name' => 'كلية التجارة - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/17.jpeg',
                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 308.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 308.0]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 299.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 299.5]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 307.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 307.0]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 299.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 299.0]
                ]
            ],
            [
                'name' => 'كلية التجارة وإدارة الأعمال - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 307.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 307.5]
                ]
            ],
            [
                'name' => 'كلية التجارة وإدارة الأعمال (انتساب موجه) - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 300.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 300.0]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 306.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 306.5]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 301.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 301.5]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 308.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 308.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 308.0],
                ],
            ],

            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 305.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 305.5]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 304.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 304.0]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 300.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 300.5]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 318.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 318.5]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 311.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 311.0]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 306.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 306.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 307.5],
                ],
            ],

            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 302.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 302.0]
                ]
            ],
            [
                'name' => 'كلية التجارة - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 317.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 317.5]
                ]
            ],
            [
                'name' => 'كلية التجارة (انتساب موجه) - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/17.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => '  مؤسسة أكاديمية تسعى إلى تأهيل الطلاب في مجالات العلوم التجارية والإدارية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف جوانب التجارة والإدارة، بهدف إعداد خريجين قادرين على المنافسة في سوق العمل.',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 307.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 307.5]
                ]
            ],

            //كليه - العلوم
            [
                'name' => 'كلية العلوم - جامعة قناة السويس (الإسماعيلية)',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/ar/كلية-العلوم/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 337.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 297.0],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المنيا، مصر',
                'website' => 'https://sci.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 335.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 281.0],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/science/ar',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 342.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 286.0],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 331.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 299.5],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طنطا، الغربية، مصر',
                'website' => 'https://sci.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 338.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 302.5],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عباس العقاد، مدينة نصر، القاهرة، مصر',
                'website' => 'https://science.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 335.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 311.0],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المنصورة، الدقهلية، مصر',
                'website' => 'https://sciencefac.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 342.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 300.5],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الجيزة، مصر',
                'website' => 'https://sci.cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 338.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 316.5],
                ],
            ],
            [
                'name' => 'كلية العلوم - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/21.jpeg',
                'description' => ' مؤسسة أكاديمية متخصصة في العلوم الطبيعية والتطبيقية. تقدم الكلية برامج دراسية متنوعة تغطي مختلف مجالات العلوم، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والصناعة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الزقازيق، محافظة الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 344.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 305.5],
                ],
            ],

            //كليه - الاداب
            [
                'name' => 'كلية الآداب - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 265.5],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 265.0],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، حلوان، مصر',
                'website' => 'https://www.helwan.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 277.5],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، مصر',
                'website' => 'https://www.tanta.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 270.5],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 277.0],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 280.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 308.0],

                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، مصر',
                'website' => 'https://www.mans.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 275.0],
                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 292.0],
                    ['study_track' => 'أدبي', 'minimum_grade' => 317.5],

                ],
            ],
            [
                'name' => 'كلية الآداب - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/8.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بالعلوم الإنسانية والاجتماعية. تقدم الكلية برامج دراسية متنوعة في مجالات اللغة والأدب والتاريخ والفلسفة وعلم الاجتماع وعلم النفس وغيرها، بهدف إعداد خريجين مؤهلين للعمل في مجالات الثقافة والتعليم والإعلام والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الزقازيق، مصر',
                'website' => 'https://www.zu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 270.5],
                ],
            ],



            //كليه -التربية

            [
                'name' => 'كلية التربية - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة قناة السويس، الإسماعيلية، مصر',
                'website' => 'https://suezuniv.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 299.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 250.5],
                ],
            ],
            [
                'name' => 'كلية التربية - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 291.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 243.0],
                ],
            ],
            [
                'name' => 'كلية التربية - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 242.0],
                ],
            ],
            [
                'name' => 'كلية التربية - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، حلوان، مصر',
                'website' => 'https://www.helwan.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 268.0],
                ],
            ],
            [
                'name' => 'كلية التربية - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، مصر',
                'website' => 'https://www.tanta.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 301.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 262.0],
                    ['study_track' => 'أدبي', 'minimum_grade' => 313.5],

                ],
            ],
            [
                'name' => 'كلية التربية - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 297.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 273.0],
                    ['study_track' => 'أدبي', 'minimum_grade' => 318.5],

                ],
            ],
            [
                'name' => 'كلية التربية - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 293.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 275.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 319.5],

                ],
            ],
            [
                'name' => 'كلية التربية - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، مصر',
                'website' => 'https://www.mans.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 310.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 253.0],
                    ['study_track' => 'أدبي', 'minimum_grade' => 318.0],

                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 257.5],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 254.5],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، مصر',
                'website' => 'https://www.tanta.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 257.0],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 259.0],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 261.5],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، مصر',
                'website' => 'https://www.mans.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 259.0],
                ],
            ],



            [
                'name' => 'كلية التربية النوعية - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 263.0],
                ],
            ],



            [
                'name' => 'كلية التربية - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/6.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الزقازيق، مصر',
                'website' => 'https://www.zu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 315.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 266.5],
                ],
            ],
            [
                'name' => 'كلية التربية النوعية - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/25.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بإعداد وتأهيل الكوادر التربوية والتعليمية. تقدم الكلية برامج دراسية متنوعة في مجالات التربية وعلم النفس والمناهج وطرق التدريس، بهدف إعداد خريجين مؤهلين للعمل في مجال التعليم والتربية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الزقازيق، مصر',
                'website' => 'https://www.zu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 255.5],
                ],
            ],

            //اثار
            [
                'name' => 'كلية الآثار - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/5.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة الحضارات القديمة والتراث الأثري. تقدم الكلية برامج دراسية متنوعة في مجالات الآثار المصرية والإسلامية واليونانية الرومانية، بهدف إعداد خريجين مؤهلين للعمل في مجالات التنقيب الأثري والترميم والمتاحف والسياحة الثقافية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 312.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 333.0],

                ],
            ],
            [
                'name' => 'كلية الآثار - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/5.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة الحضارات القديمة والتراث الأثري. تقدم الكلية برامج دراسية متنوعة في مجالات الآثار المصرية والإسلامية واليونانية الرومانية، بهدف إعداد خريجين مؤهلين للعمل في مجالات التنقيب الأثري والترميم والمتاحف والسياحة الثقافية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://www.faa.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 315.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 334.0],

                ],
            ],
            [
                'name' => 'كلية الآثار - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/5.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة الحضارات القديمة والتراث الأثري. تقدم الكلية برامج دراسية متنوعة في مجالات الآثار المصرية والإسلامية واليونانية الرومانية، بهدف إعداد خريجين مؤهلين للعمل في مجالات التنقيب الأثري والترميم والمتاحف والسياحة الثقافية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، صان الحجر، الشرقية، مصر',
                'website' => 'https://www.sue.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 327.5],
                ],
            ],

            //الحقوق
            [
                'name' => 'كلية الحقوق - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 323.5],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 287.5],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، حلوان، مصر',
                'website' => 'https://www.helwan.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 273.0],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، مصر',
                'website' => 'https://www.tanta.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 274.0],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الإسكندرية، الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 277.5],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 275.0],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، مصر',
                'website' => 'https://www.mans.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 282.0],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 280.5],
                ],
            ],
            [
                'name' => 'كلية الحقوق - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/18.jpeg',
                'description' => ' مؤسسة أكاديمية تُعنى بدراسة القانون والعلوم القانونية. تقدم الكلية برامج دراسية متنوعة في مجالات القانون المدني والجنائي والدولي والإداري، بهدف إعداد خريجين مؤهلين للعمل في مجال المحاماة والقضاء والاستشارات القانونية والبحث العلمي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الزقازيق، مصر',
                'website' => 'https://www.zu.edu.eg/', // General university website
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 289.5],
                ],
            ],

            //تمريض
            [
                'name' => 'كلية التمريض - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/14.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 353.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 318.5]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 345.5]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 317.0]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 348.5]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 321.5]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 349.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 313.0]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 357.5]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 328.5]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 349.5]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 322.5]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 350.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 314.0]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 361.5]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 329.0]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 351.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض أورام - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 318.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 317.5]
                ]
            ],
            [
                'name' => 'كلية التمريض - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/14.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 355.0]
                ]
            ],
            [
                'name' => 'معهد فني تمريض - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/15.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 2,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',

                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل كوادر التمريض المؤهلة لتقديم الرعاية الصحية للمرضى. تقدم الكلية برامج دراسية متنوعة في مجالات التمريض الباطني والجراحي وتمريض الأطفال والنساء والتوليد، بهدف إعداد خريجين مؤهلين للعمل في المستشفيات والمراكز الصحية والمجتمع.',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 326.0]
                ]
            ],

            //طب
            [
                'name' => 'كلية الطب - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/index.php/ar/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 388.0],
                ],
            ],
            [
                'name' => 'كلية الطب - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 384.5]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.0]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 361.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 383.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.5]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 365.0]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 384.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.5]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 367.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 384.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 387.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجيش، طنطا، الغربية، مصر',
                'website' => 'https://www.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/index.php/ar/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 388.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.0]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 364.0]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 385.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.0]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، القاهرة، مصر',
                'website' => 'https://www.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 365.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 390.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 385.0]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 371.5]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 387.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.0]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع القصر العيني، الجيزة، مصر',
                'website' => 'https://cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 363.0]
                ]
            ],
            [
                'name' => 'كلية الطب - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/1.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 7,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 389.0]
                ]
            ],
            [
                'name' => 'كلية طب الأسنان - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/11.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 381.5]
                ]
            ],
            [
                'name' => 'كلية الطب البيطري - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/12.jpeg',
                'description' => ' تقدم برنامجاً دراسياً يشمل الدراسة النظرية والتدريب العملي، وتركز على إعداد أطباء مؤهلين لسوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 368.5]
                ]
            ],

            //صيدلة
            [
                'name' => 'كلية الصيدلة - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، جامعة قناة السويس، مصر',
                'website' => 'https://pharm.suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/Pharmacy/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/pharmacy/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 378.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عين حلوان، القاهرة، مصر',
                'website' => 'https://pharmacy.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 376.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، طنطا، الغربية، مصر',
                'website' => 'https://pharmacy.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع قنال المحمودية، الإسكندرية، مصر',
                'website' => 'https://www.ph.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عبده باشا، العباسية، القاهرة، مصر',
                'website' => 'https://pharm.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 376.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، الدقهلية، مصر',
                'website' => 'https://phfac.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 378.5],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، الجيزة، مصر',
                'website' => 'https://pharma.cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.0],
                ],
            ],
            [
                'name' => 'كلية الصيدلة - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/10.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الصيادلة المؤهلين لتقديم الخدمات الصيدلانية للمرضى والمجتمع. تقدم الكلية برامج دراسية متنوعة في مجالات الصيدلة الإكلينيكية والصيدلة الصناعية والعلوم الصيدلانية الأساسية، بهدف إعداد خريجين مؤهلين للعمل في الصيدليات والمستشفيات وشركات الأدوية ومراكز البحوث.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الشرقية، مصر',
                'website' => 'https://pharm.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 377.5],
                ],
            ],

            //هندسة
            [
                'name' => 'كلية الهندسة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'عباس العقاد، مدينة نصر، القاهرة، مصر',
                'website' => 'https://eng.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 373.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، المنصورة، الدقهلية، مصر',
                'website' => 'https://engfac.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 374.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، جامعة قناة السويس، مصر',
                'website' => 'https://eng.suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 372.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة طنطا، الغربية، مصر',
                'website' => 'https://eng.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 370.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع أبو قير، الشاطبي، الإسكندرية، مصر',
                'website' => 'https://eng.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 369.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة حلوان، القاهرة، مصر',
                'website' => 'https://eng.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 367.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة أسيوط، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/faculty-engineering/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 364.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، محافظة المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/eng/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 364.0],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://eng.cu.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 376.5],
                ],
            ],
            [
                'name' => 'كلية الهندسة - جامعة الزقازيق',
                'university' => 'جامعة الزقازيق',
                'pic' => 'uni/f/9.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل المهندسين المؤهلين للعمل في مختلف المجالات الهندسية. تقدم الكلية برامج دراسية متنوعة في مجالات الهندسة المدنية والمعمارية والكهربائية والميكانيكية والكيميائية، بهدف إعداد خريجين مؤهلين للعمل في سوق العمل المحلي والدولي.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة الزقازيق، الشرقية، مصر',
                'website' => 'https://www.zu.edu.eg/',
                'location' => 'https://goo.gl/maps/5bW1h8o9umr5c3FG7',
                'logo' => 'logos/zagazig_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 372.0],
                ],
            ],

            //دراسات اقتصادية
            [
                'name' => 'كلية الدراسات الاقتصادية والعلوم السياسية - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'description' => 'كلية الدراسات الاقتصادية والعلوم السياسية بجامعة الإسكندرية هي مؤسسة أكاديمية تُعنى بدراسة العلوم الاقتصادية والسياسية. تقدم الكلية برامج دراسية متنوعة في مجالات الاقتصاد والعلوم السياسية والإحصاء، بهدف إعداد خريجين مؤهلين للعمل في مجالات البحث العلمي والتدريس والاستشارات الاقتصادية والسياسية.',
                'duration' => 4,
                'pic' => 'uni/f/2.jpeg',
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات.',
                'address' => 'شارع سوتر، الشاطبي، الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => json_encode([
                    ['study_track' => 'أدبي', 'minimum_grade' => 358.5],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 354.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 337.5],
                ]),
            ],

            //-اعلام
            [
                'name' => 'كلية الإعلام - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/4.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الإعلاميين المؤهلين للعمل في مختلف مجالات الإعلام. تقدم الكلية برامج دراسية متنوعة في مجالات الصحافة والإذاعة والتلفزيون والعلاقات العامة والإعلان، بهدف إعداد خريجين مؤهلين للعمل في وسائل الإعلام المحلية والدولية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة عين شمس، القاهرة، مصر',
                'website' => 'https://www.fms.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 333.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 325.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 349.0],
                ],
            ],
            [
                'name' => 'كلية الإعلام - جامعة القاهرة',
                'university' => 'جامعة القاهرة',
                'pic' => 'uni/f/4.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الإعلاميين المؤهلين للعمل في مختلف مجالات الإعلام. تقدم الكلية برامج دراسية متنوعة في مجالات الصحافة والإذاعة والتلفزيون والعلاقات العامة والإعلان، بهدف إعداد خريجين مؤهلين للعمل في وسائل الإعلام المحلية والدولية.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة القاهرة، الجيزة، مصر',
                'website' => 'https://www.fms.edu.eg/',
                'location' => 'https://goo.gl/maps/4S5Ma7o5umr5c3FG7',
                'logo' => 'logos/cairo_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 336.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 327.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 354.5],
                ],
            ],

            //السن
            [
                'name' => 'كلية الألسن - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/3.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بدراسة اللغات والترجمة. تقدم الكلية برامج دراسية متنوعة في مجالات اللغات الأجنبية والترجمة واللغويات، بهدف إعداد خريجين مؤهلين للعمل في مجالات الترجمة والتدريس والبحث العلمي والإعلام والسياحة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الخليفة المأمون، العباسية، القاهرة',
                'website' => 'https://alsun.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 358.5],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 348.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 334.0],
                ],
            ],

            [
                'name' => 'كلية الألسن - جامعة قناة السويس بالإسماعيلية',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/3.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بدراسة اللغات والترجمة. تقدم الكلية برامج دراسية متنوعة في مجالات اللغات الأجنبية والترجمة واللغويات، بهدف إعداد خريجين مؤهلين للعمل في مجالات الترجمة والتدريس والبحث العلمي والإعلام والسياحة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الكيلو ٤.٥، الطريق الدائري، الإسماعيلية، مصر',
                'website' => 'https://suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 351.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 331.5]
                ]
            ],
            [
                'name' => 'كلية ألسن - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/3.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بدراسة اللغات والترجمة. تقدم الكلية برامج دراسية متنوعة في مجالات اللغات الأجنبية والترجمة واللغويات، بهدف إعداد خريجين مؤهلين للعمل في مجالات الترجمة والتدريس والبحث العلمي والإعلام والسياحة.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، محافظة المنيا، مصر',
                'website' => 'https://www.menofia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 348.5],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 339.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 316.5],
                ],
            ],

            //فنادق
            [
                'name' => 'كلية السياحة والفنادق - جامعة قناة السويس',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/22.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع السياحة والضيافة. تقدم الكلية برامج دراسية متنوعة في مجالات إدارة الفنادق والضيافة والإرشاد السياحي والدراسات السياحية، بهدف إعداد خريجين مؤهلين للعمل في الفنادق والمنتجعات والشركات السياحية ووكالات السفر.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة قناة السويس، الإسماعيلية، مصر',
                'website' => 'https://suh.suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
                ],
            ],
            [
                'name' => 'كلية السياحة والفنادق - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/22.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع السياحة والضيافة. تقدم الكلية برامج دراسية متنوعة في مجالات إدارة الفنادق والضيافة والإرشاد السياحي والدراسات السياحية، بهدف إعداد خريجين مؤهلين للعمل في الفنادق والمنتجعات والشركات السياحية ووكالات السفر.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنيا، طريق مصر أسيوط الزراعي، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/tourism/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
                ],
            ],
            [
                'name' => 'كلية السياحة والفنادق - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/22.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع السياحة والضيافة. تقدم الكلية برامج دراسية متنوعة في مجالات إدارة الفنادق والضيافة والإرشاد السياحي والدراسات السياحية، بهدف إعداد خريجين مؤهلين للعمل في الفنادق والمنتجعات والشركات السياحية ووكالات السفر.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الطابية، قسم باب شرق، الإسكندرية، مصر',
                'website' => 'https://alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
                ],
            ],
            [
                'name' => 'كلية السياحة والفنادق - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/22.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع السياحة والضيافة. تقدم الكلية برامج دراسية متنوعة في مجالات إدارة الفنادق والضيافة والإرشاد السياحي والدراسات السياحية، بهدف إعداد خريجين مؤهلين للعمل في الفنادق والمنتجعات والشركات السياحية ووكالات السفر.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'جامعة المنصورة، الدقهلية، مصر',
                'website' => 'https://www.tourismfac.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'أدبي', 'minimum_grade' => 246.0],
                ],
            ],

            //فنون جميلة
            [
                'name' => 'كلية الفنون الجميلة (عمارة) - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 321.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (فنون) - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طريق المنيا الجديدة، المنيا، مصر',
                'website' => 'https://www.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 290.5],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 290.5]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (عمارة) - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 319.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (فنون) - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، أسيوط، مصر',
                'website' => 'https://www.aun.edu.eg/',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 288.0],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 288.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (عمارة) - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 337.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (فنون) - جامعة حلوان',
                'university' => 'جامعة حلوان',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجامعة، حلوان، القاهرة، مصر',
                'website' => 'https://www.helwan.edu.eg/',
                'location' => 'https://goo.gl/maps/6cX2i9p0umr5c3FG7',
                'logo' => 'logos/helwan_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 298.5],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 298.5],
                    ['study_track' => 'أدبي', 'minimum_grade' => 316.0],

                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (عمارة) - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية 5372066، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 332.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (فنون) - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المُسَلَّة شرق، العطارين، محافظة الإسكندرية، مصر',
                'website' => 'https://www.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 298.0],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 298.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (عمارة) - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية 35516، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 330.0]
                ]
            ],
            [
                'name' => 'كلية الفنون الجميلة (فنون) - جامعة المنصورة',
                'university' => 'جامعة المنصورة',
                'pic' => 'uni/f/7.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الفنانين والمصممين المؤهلين للعمل في مختلف مجالات الفنون الجميلة. تقدم الكلية برامج دراسية متنوعة في مجالات التصوير والنحت والجرافيك والتصميم والعمارة، بهدف إعداد خريجين مؤهلين للعمل في مجالات الفن التشكيلي والتصميم الجرافيكي والمعماري والترميم.',
                'duration' => 5,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'شارع الجمهورية، المنصورة، محافظة الدقهلية، مصر',
                'website' => 'https://www.mans.edu.eg/',
                'location' => 'https://goo.gl/maps/4aV0g7o8umr5c3FG7',
                'logo' => 'logos/mansoura_university.png',
                'grades' => [
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 296.0],
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 296.0]
                ]
            ],

            //زراعة
            [
                'name' => 'كلية الزراعة - جامعة قناة السويس (الإسماعيلية)',
                'university' => 'جامعة قناة السويس',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسماعيلية، مصر',
                'website' => 'https://agri.suez.edu.eg/',
                'location' => 'https://goo.gl/maps/8eZ4k1r2umr5c3FG7',
                'logo' => 'logos/suez_canal_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 285.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 265.0],
                ],
            ],
            [
                'name' => 'كلية الزراعة - جامعة المنيا',
                'university' => 'جامعة المنيا',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'المنيا، مصر',
                'website' => 'https://agr.minia.edu.eg/',
                'location' => 'https://goo.gl/maps/7dY3j0q1umr5c3FG7',
                'logo' => 'logos/minia_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 283.5],
                ],
            ],
            [
                'name' => 'كلية الزراعة - جامعة أسيوط',
                'university' => 'جامعة أسيوط',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'أسيوط، مصر',
                'website' => 'https://aun.edu.eg/agriculture/ar',
                'location' => 'https://goo.gl/maps/3zU9f6o7umr5c3FG7',
                'logo' => 'logos/assiut_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 283.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 265.0],
                ],
            ],
            [
                'name' => 'كلية الزراعة - جامعة طنطا',
                'university' => 'جامعة طنطا',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'طنطا، مصر',
                'website' => 'https://agr.tanta.edu.eg/',
                'location' => 'https://goo.gl/maps/9fA5l2s3umr5c3FG7',
                'logo' => 'logos/tanta_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 294.5],
                ],
            ],
            [
                'name' => 'كلية الزراعة - جامعة الإسكندرية',
                'university' => 'جامعة الإسكندرية',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'الإسكندرية، مصر',
                'website' => 'https://agr.alexu.edu.eg/',
                'location' => 'https://goo.gl/maps/2yT8e5o6umr5c3FG7',
                'logo' => 'logos/alexandria_university.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 300.0],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 296.0],
                ],
            ],
            [
                'name' => 'كلية الزراعة - جامعة عين شمس',
                'university' => 'جامعة عين شمس',
                'pic' => 'uni/f/20.jpeg',
                'description' => 'مؤسسة أكاديمية تُعنى بتأهيل الكوادر المؤهلة للعمل في قطاع الزراعة والإنتاج الحيواني. تقدم الكلية برامج دراسية متنوعة في مجالات علوم الأراضي والمياه والمحاصيل والبساتين والإنتاج الحيواني، بهدف إعداد خريجين مؤهلين للعمل في مجالات الإنتاج الزراعي والحيواني والبحث العلمي الزراعي.',
                'duration' => 4,
                'requirements' => 'يشترط القبول في الكلية الحصول على شهادة الثانوية العامة (شعبة علمي علوم) بمجموع لا يقل عن الحد الأدنى للقبول المُعلن. تشمل الأوراق المطلوبة: أصل شهادة الثانوية العامة، بطاقة الرقم القومي، شهادة الميلاد، ٦ صور شخصية حديثة، استمارة ٢ جند (للذكور)، واستمارة ٦ جند أو ٧ جند حسب الموقف من التجنيد. يُفضل إحضار نسخة إلكترونية من المستندات ',
                'address' => 'القاهرة، مصر',
                'website' => 'https://agr.asu.edu.eg/',
                'location' => 'https://goo.gl/maps/1zG7e4o5umr5c3FG7',
                'logo' => 'logos/ain_shams.png',
                'grades' => [
                    ['study_track' => 'علمي علوم', 'minimum_grade' => 300.5],
                    ['study_track' => 'علمي رياضة', 'minimum_grade' => 286.0],
                ],
            ],





        ];











        //     foreach ($faculties as $facultyData) {
        //         if (!isset($facultyData['university']) || empty($facultyData['university'])) {
        //             Log::warning('University key is missing or empty for faculty: ' . json_encode($facultyData));
        //             continue;
        //         }

        //         // Find university
        //         $university = University::where('name', $facultyData['university'])->first();

        //         if (!$university) {
        //             Log::warning('University not found: ' . $facultyData['university'] . '|' . $facultyData['name']);
        //             continue; // Skip if university is not found
        //         }

        //         // Create faculty
        //         $faculty = Faculty::create([
        //             'name' => $facultyData['name'],
        //             'university_id' => $university->id,
        //             'description' => $facultyData['description'],
        //             'duration' => $facultyData['duration'],
        //             'requirements' => $facultyData['requirements'],
        //             'location' => $facultyData['location'],
        //             'address' => $facultyData['address'],
        //             'website' => $facultyData['website'],
        //             'logo' => $facultyData['logo'],
        //         ]);

        //         // Check if the study_track value is valid before inserting
        //         $validStudyTracks = ['علمي علوم', 'علمي رياضة', 'أدبي'];
        //         foreach ($facultyData['grades'] as $grade) {
        //             if (!in_array($grade['study_track'], $validStudyTracks)) {
        //                 Log::warning('Invalid study track: ' . $grade['study_track'] . '|' . $facultyData['name']);
        //                 continue; // Skip invalid study track
        //             }
        //             // Add grades
        //             $gradesData = [];
        //             foreach ($facultyData['grades'] as $grade) {
        //                 // Log::info('Inserting grade for study track: ' . $grade['study_track']);

        //                 $gradesData[] = [
        //                     'faculty_id' => $faculty->id,
        //                     'study_track' => $grade['study_track'],
        //                     'minimum_grade' => $grade['minimum_grade'],
        //                 ];
        //             }
        //             FacultyGrade::insert($gradesData);
        //         }
        //     }
        // }


        foreach ($faculties as $facultyData) {
            DB::beginTransaction();
            try {
                if (!isset($facultyData['university']) || empty($facultyData['university'])) {
                    Log::warning('University key is missing or empty for faculty: ' . json_encode($facultyData));
                    throw new \Exception('Invalid university data.');
                }

                $university = University::where('name', $facultyData['university'])->first();

                if (!$university) {
                    Log::warning('University not found: ' . $facultyData['university'] . '|' . $facultyData['name']);
                    throw new \Exception('University not found.');
                }

                $faculty = Faculty::create([
                    'name' => $facultyData['name'],
                    'university_id' => $university->id,
                    'description' => $facultyData['description'],
                    'pic' => $facultyData['pic'],
                    'duration' => $facultyData['duration'],
                    'requirements' => $facultyData['requirements'],
                    'location' => $facultyData['location'],
                    'address' => $facultyData['address'],
                    'website' => $facultyData['website'],
                    'logo' => $facultyData['logo'],
                ]);

                $validStudyTracks = ['علمي علوم', 'علمي رياضة', 'أدبي'];
                $gradesData = [];

                if (is_string($facultyData['grades'])) {
                    $facultyData['grades'] = json_decode($facultyData['grades'], true);
                    if (json_last_error() !== JSON_ERROR_NONE) {
                        Log::error('Invalid JSON in grades field: ' . $facultyData['name'] . ' - ' . json_last_error_msg());
                        throw new \Exception('Invalid grades JSON.');
                    }
                }

                if (!is_array($facultyData['grades'])) {
                    Log::error('Grades field is not an array: ' . $facultyData['name']);
                    throw new \Exception('Grades field is not array');
                }

                foreach ($facultyData['grades'] as $grade) {
                    if (!in_array($grade['study_track'], $validStudyTracks)) {
                        Log::warning('Invalid study track: ' . $grade['study_track'] . '|' . $facultyData['name']);
                        throw new \Exception('Invalid study track.');
                    }

                    $gradesData[] = [
                        'faculty_id' => $faculty->id,
                        'study_track' => $grade['study_track'],
                        'minimum_grade' => $grade['minimum_grade'],
                    ];
                }

                FacultyGrade::insert($gradesData);

                DB::commit();
            } catch (\Exception $e) {
                DB::rollBack();
                Log::error('Error processing faculty ' . $facultyData['name'] . ': ' . $e->getMessage());
            }
        }
    }
}
